Qala_Mobile_app/src/InformationRegisters/Уведомления/Уведомления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Уведомления</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Показан</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Qala_Mobile_app/src/Documents/ВнутреннийЗаказ/ВнутреннийЗаказ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВнутреннийЗаказ</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>155</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодтвержедия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Qala_Mobile_app/src/Documents/ЗаказПоставщику/ЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПоставщику</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоступления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>155</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодтвержедия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Qala_Mobile_app/src/CommonModules/Вспомогательный/Module.bsl
Функция НастройкиЗаполнены() Экспорт 
	
	НастройкиЗаполнены = Истина;
	
	Если Не ЗначениеЗаполнено(Константы.Сервер.Получить()) Тогда 
		НастройкиЗаполнены = Ложь;
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Константы.Пользователь.Получить()) Тогда 
		НастройкиЗаполнены = Ложь;
	КонецЕсли;
	
	Если Не Константы.НастройкиЗаполнены.Получить() Тогда 
		НастройкиЗаполнены = Ложь;
	КонецЕсли;	
	
	Возврат НастройкиЗаполнены;
	
КонецФункции


Функция НастройкиОбменаЗаполнены() Экспорт 
	
	НастройкиЗаполнены = Истина;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МобОбмен.Ссылка КАК Ссылка,
	               |	МобОбмен.ЭтотУзел КАК ЭтотУзел,
	               |	МобОбмен.Код КАК Код
	               |ИЗ
	               |	ПланОбмена.МобОбмен КАК МобОбмен";
	
    Выборка = Запрос.Выполнить().Выбрать();	
	
	Если Выборка.Количество() = 1 Тогда 
		НастройкиЗаполнены = Ложь;		
	КонецЕсли;	
	
	Выборка.Следующий();
	
	Если Не ЗначениеЗаполнено(Выборка.Код) Тогда 
		НастройкиЗаполнены = Ложь;		
	КонецЕсли;	
	
	Если  Не Константы.НастройкиЗаполнены.Получить() Тогда 
		НастройкиЗаполнены = Ложь;		
	КонецЕсли;	
	
	Возврат НастройкиЗаполнены;

	
	
КонецФункции	


Процедура ПроверитьИдентификаторНаСервере() Экспорт 
    
    // Системная информация
	Если НЕ ЗначениеЗаполнено(Константы.IDКлиента.Получить()) Тогда
        
        СИ = Новый СистемнаяИнформация;
		Константы.IDКлиента.Установить(СИ.ИдентификаторКлиента);                
	КонецЕслИ;
    
КонецПроцедуры



Функция ПроверитьВыполнениеФЗ(Ключ) Экспорт 
	Структура = Новый Структура;
	Структура.Вставить("Ключ",Ключ);
	ФЗ = ФоновыеЗадания.ПолучитьФоновыеЗадания(Структура);
	
			

	Если ФЗ.Количество() > 0 Тогда
		ПоследнееФЗ = ФЗ.Получить(0);
		
		Если ПоследнееФЗ.ИнформацияОбОшибке = Неопределено Тогда 
			Возврат Ложь;
		КонецЕсли;	
		
		Возврат ПоследнееФЗ.ИнформацияОбОшибке.Описание;
	КонецЕсли;	
	Возврат Ложь;
КонецФункции



Процедура ДобавитьВРегистрОповещенийНаСервере(СтруктураДанных) Экспорт 
	МенеджерЗаписи = РегистрыСведений.Уведомления.СоздатьМенеджерЗаписи();
	Если СтруктураДанных.ТипДокумента = "ВнутреннийЗаказ" Тогда 
		СсылкаДок =  Документы.ВнутреннийЗаказ.ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураДанных.IDДок));
	ИначеЕсли СтруктураДанных.ТипДокумента = "ЗаказПоставщику" Тогда 
		СсылкаДок =  Документы.ЗаказПоставщику.ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураДанных.IDДок));
	ИначеЕсли СтруктураДанных.ТипДокумента = "ЗаявкаНаРасходованиеДС" Тогда 
		СсылкаДок =  Документы.ЗаявкиНаРсходованиеСредств.ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураДанных.IDДок));	
	КонецЕсли;
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Документ = СсылкаДок;
	МенеджерЗаписи.Показан = Ложь;
	МенеджерЗаписи.Записать();

КонецПроцедуры	

Процедура ДобавитьПрочитанВРегистрОповещенийНаСервере(Ссылка) Экспорт 
	НаборЗаписей = РегистрыСведений.Уведомления.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Значение =  Ссылка;
	НаборЗаписей.Отбор.Документ.Использование = Истина;
	//НаборЗаписей.Отбор.Показан.Значение = Истина;
	НаборЗаписей.Прочитать();
	
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
	
	МенеджерЗаписи = РегистрыСведений.Уведомления.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Документ = Ссылка;
	МенеджерЗаписи.Показан = Истина;
	МенеджерЗаписи.Записать();

КонецПроцедуры
